sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller-v2.cpp
    // PID Debug Section
    bool pid_active;
    bool pid_enabled_by_throttle;
    float roll_output;
    float pitch_output;
    float yaw_output;
    float roll_setpoint;
    float pitch_setpoint;
    float yaw_setpoint;

    // Calibration Debug Section
    bool imu_cal_active;
    float roll_cal_offset;
    float pitch_cal_offset;

    // Motor Mix Section
    int base_pwm;
    int motor1_final;
    int motor2_final;
    int motor3_final;
    int motor4_final;
    float motor1_offset;
    float motor2_offset;
    float motor3_offset;
    float motor4_offset;

    // Inputs Section
    float roll_input;
    float pitch_input;
    float yaw_input;

    // System Section
    bool sensors_ok;
    bool emergency_active;
    bool imu_calibrated;
    unsigned long uptime;
    unsigned int free_heap;

    // Update timestamp
    unsigned long timestamp;
};

MotorOutputs motorOutputs;

// Debug data for web dashboard
DebugData debugData;

// Motor calibration offsets to compensate for mechanical imbalances
// Negative values reduce motor power, positive values increase it
struct MotorCalibration
{
    float motor1_offset; // Front Right
    float motor2_offset; // Back Right
    float motor3_offset; // Front Left (reduce if left side lifts early)
    float motor4_offset; // Back Left (reduce if left side lifts early)
};

// Motor calibration - fixed values based on testing
MotorCalibration motorCal = {
    .motor1_offset = -15.0, // Front Right - reduce by 15 PWM units
    .motor2_offset = -15.0, // Back Right - reduce by 15 PWM units
    .motor3_offset = -8.0,  // Front Left - reduce by 8 PWM units (fixed one-side lifting)
    .motor4_offset = -8.0   // Back Left - reduce by 8 PWM units (fixed one-side lifting)
};

// Function Declarations
void initializeHardware();
void initializePIDControllers();
void setupWebServer();
void connectWiFi();

// FreeRTOS Task Functions
void controlTask(void *parameter);
void sensorTask(void *parameter);
void telemetryTask(void *parameter);

// Core Flight Functions
void updateSensors();
void calculateOrientation();
void runPIDControllers();
void mixMotorOutputs();
void outputMotorCommands();
void checkSafetyConditions();
void handleEmergency();

// Utility Functions
float mapFloat(float x, float in_min, float in_max, float out_min, float out_max);
float constrainFloat(float value, float min_val, float max_val);
void updateFlightMode();
void calibrateIMU();

// LED Control Functions
void initializeLEDs();
void updateNavigationLights();
void updateStatusLights();
void setThrottlePulse(float throttle_percentage);

void setup()
{
    Serial.begin(115200);
    Serial.println("ESP32 Weather Drone Flight Controller Starting...");

    // Initialize hardware
    initializeHardware();

    // Calibrate IMU to set proper setpoints for level flight
    Serial.println("Starting IMU calibration...");
    calibrateIMU();
    Serial.println("IMU calibration completed!");

    // Initialize flight state
    flightState.mode = MODE_DISARMED;
    flightState.motors_armed = false;
    flightState.emergency_stop = false;
    flightState.gps_available = false;
    flightState.altitude_hold_active = false; // Ensure altitude hold starts disabled
    flightState.hover_throttle = MOTOR_HOVER_ESTIMATE;
    flightState.last_command_time = 0;
    flightState.arm_time = 0;

    // Initialize control inputs
    memset(&controlInputs, 0, sizeof(controlInputs));
    memset(&sensorData, 0, sizeof(sensorData));

    // Set initial sensor timestamp to prevent immediate emergency
    sensorData.timestamp = millis();

    // Initialize PID controllers
    initializePIDControllers();

    // Connect to WiFi
    connectWiFi();

    // Setup web server
    setupWebServer();

    // Create FreeRTOS synchronization primitives
    sensorMutex = xSemaphoreCreateMutex();
    commandQueue = xQueueCreate(10, sizeof(ControlInputs));

    // Create FreeRTOS tasks with larger stack sizes
    xTaskCreatePinnedToCore(
        controlTask,        // Function
        "Control Task",     // Name
        8192,               // Stack size (increased)
        NULL,               // Parameters
        3,                  // Priority (higher = more important)
        &controlTaskHandle, // Handle
        1                   // Core (0 or 1)
    );

    xTaskCreatePinnedToCore(
        sensorTask,        // Function
        "Sensor Task",     // Name
        8192,              // Stack size (increased)
        NULL,              // Parameters
        2,                 // Priority
        &sensorTaskHandle, // Handle
        0                  // Core
    );

    xTaskCreatePinnedToCore(
        telemetryTask,        // Function
        "Telemetry Task",     // Name
        4096,                 // Stack size (doubled)
        NULL,                 // Parameters
        1,                    // Priority
        &telemetryTaskHandle, // Handle
        0                     // Core
    );

    Serial.println("Flight Controller initialized successfully!");
    Serial.println("Starting control tasks...");
}

void loop()
{
    // Handle web server requests
    server.handleClient();

    // Main loop runs at lower priority - FreeRTOS handles the control loops
    delay(10);
}

void initializeHardware()
{
    // Initialize pins
    pinMode(LED_R1_PIN, OUTPUT);
    pinMode(LED_G1_PIN, OUTPUT);
    pinMode(LED_B1_PIN, OUTPUT);
    pinMode(BUZZER_PIN, OUTPUT);
    pinMode(GUVA_PIN, INPUT);
    pinMode(BATTERY_PIN, INPUT);

    // Initialize navigation LED pins
    initializeLEDs();

    // Set ADC attenuation for battery monitoring
    analogSetAttenuation(ADC_11db);

    // Initialize I2C
    Wire.begin(SDA_PIN, SCL_PIN);
    Wire.setClock(400000); // 400kHz for faster sensor reads

    // Initialize SPI for NRF24L01
    SPI.begin(18, 19, 23, 5);

    // Initialize MPU6050 IMU
    if (mpu.begin(0x68))
    {
        mpu.setAccelerometerRange(MPU6050_RANGE_8_G);
        mpu.setGyroRange(MPU6050_RANGE_500_DEG);
        mpu.setFilterBandwidth(MPU6050_BAND_21_HZ);
        Serial.println("MPU6050 initialized successfully");
    }
    else
    {
        Serial.println("ERROR: MPU6050 initialization failed!");
    }

    // Initialize BME280
    if (bme.begin(0x76) || bme.begin(0x77))
    {
        Serial.println("BME280 initialized successfully");
    }
    else
    {
        Serial.println("ERROR: BME280 initialization failed!");
    }

