sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller-v2.cpp
    // Initialize ESCs
    esc1.attach(ESC1_PIN, MOTOR_MIN, MOTOR_MAX);
    esc2.attach(ESC2_PIN, MOTOR_MIN, MOTOR_MAX);
    esc3.attach(ESC3_PIN, MOTOR_MIN, MOTOR_MAX);
    esc4.attach(ESC4_PIN, MOTOR_MIN, MOTOR_MAX);

    // Set motors to minimum (safety)
    esc1.writeMicroseconds(MOTOR_ARM_VALUE);
    esc2.writeMicroseconds(MOTOR_ARM_VALUE);
    esc3.writeMicroseconds(MOTOR_ARM_VALUE);
    esc4.writeMicroseconds(MOTOR_ARM_VALUE);

    Serial.println("Hardware initialization complete");

    // Brief startup sequence using navigation LEDs
    // Red LEDs first
    digitalWrite(NAV_BACK_LEFT_RED, HIGH);
    digitalWrite(NAV_FRONT_LEFT_RED, HIGH);
    delay(200);
    digitalWrite(NAV_BACK_LEFT_RED, LOW);
    digitalWrite(NAV_FRONT_LEFT_RED, LOW);

    // Green LEDs next
    digitalWrite(NAV_FRONT_RIGHT_GREEN, HIGH);
    digitalWrite(NAV_BACK_RIGHT_GREEN, HIGH);
    delay(200);

    // White center LEDs last
    digitalWrite(NAV_FRONT_CENTER_WHITE, HIGH);
    digitalWrite(NAV_BACK_CENTER_WHITE, HIGH);
    delay(200);
    digitalWrite(NAV_FRONT_CENTER_WHITE, LOW);
    digitalWrite(NAV_BACK_CENTER_WHITE, LOW);

    // Startup beep
    digitalWrite(BUZZER_PIN, HIGH);
    delay(150);
    digitalWrite(BUZZER_PIN, LOW);
}

void initializePIDControllers()
{
    // Update PID tuning parameters first
    rollPID.SetTunings(pidParams.roll_kp, pidParams.roll_ki, pidParams.roll_kd);
    pitchPID.SetTunings(pidParams.pitch_kp, pidParams.pitch_ki, pidParams.pitch_kd);
    yawPID.SetTunings(pidParams.yaw_kp, pidParams.yaw_ki, pidParams.yaw_kd);
    altitudePID.SetTunings(pidParams.altitude_kp, pidParams.altitude_ki, pidParams.altitude_kd);

    // Configure Roll PID with increased limits for better correction authority
    rollPID.SetMode(AUTOMATIC);
    rollPID.SetOutputLimits(-400, 400); // Increased from ±200 for stronger correction
    rollPID.SetSampleTime(CONTROL_LOOP_PERIOD);

    // Configure Pitch PID with increased limits for better correction authority
    pitchPID.SetMode(AUTOMATIC);
    pitchPID.SetOutputLimits(-400, 400); // Increased from ±200 for stronger correction
    pitchPID.SetSampleTime(CONTROL_LOOP_PERIOD);

    // Configure Yaw PID with increased limits
    yawPID.SetMode(AUTOMATIC);
    yawPID.SetOutputLimits(-200, 200); // Increased from ±100 for better yaw authority
    yawPID.SetSampleTime(CONTROL_LOOP_PERIOD);

    // Configure Altitude PID
    altitudePID.SetMode(AUTOMATIC);
    altitudePID.SetOutputLimits(0, 1000); // Throttle addition
    altitudePID.SetSampleTime(CONTROL_LOOP_PERIOD);

    Serial.println("PID controllers initialized with increased limits for better stabilization");
    Serial.printf("PID Gains - Roll: P=%.2f I=%.2f D=%.3f, Pitch: P=%.2f I=%.2f D=%.3f, Yaw: P=%.2f I=%.2f D=%.3f\n",
                  pidParams.roll_kp, pidParams.roll_ki, pidParams.roll_kd,
                  pidParams.pitch_kp, pidParams.pitch_ki, pidParams.pitch_kd,
                  pidParams.yaw_kp, pidParams.yaw_ki, pidParams.yaw_kd);
}

void connectWiFi()
{
    WiFi.begin(ssid, password);
    Serial.print("Connecting to WiFi");

    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 20)
    {
        delay(500);
        Serial.print(".");
        attempts++;
    }

    if (WiFi.status() == WL_CONNECTED)
    {
        Serial.println();
        Serial.print("WiFi connected! IP: ");
        Serial.println(WiFi.localIP());
    }
    else
    {
        Serial.println();
        Serial.println("WiFi connection failed!");
    }
}

// We'll continue with the task implementations in the next part...

// ================================
// FREERTOS TASK IMPLEMENTATIONS
// ================================

void controlTask(void *parameter)
{
    TickType_t xLastWakeTime = xTaskGetTickCount();
    const TickType_t xFrequency = pdMS_TO_TICKS(CONTROL_LOOP_PERIOD);

    Serial.println("Control Task started - Running at 100Hz");

    while (true)
    {
        // Wait for the next cycle
        vTaskDelayUntil(&xLastWakeTime, xFrequency);

        // Check safety conditions first
        checkSafetyConditions();

        if (flightState.emergency_stop)
        {
            handleEmergency();
            continue;
        }

        // Update flight mode based on inputs
        updateFlightMode();

        // Update LED status indicators
        updateStatusLights();
        updateNavigationLights();

        // Comprehensive Debug Data Collection for Web Dashboard
        static int debug_counter = 0;
        if (++debug_counter >= 100)
        { // Every 1 second at 100Hz for smooth web updates
            debug_counter = 0;

            // Update debug data structure for web dashboard
            if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(2)) == pdTRUE)
            {
                // Status Section
                switch (flightState.mode)
                {
                case MODE_MANUAL:
                    debugData.flight_mode = "MANUAL";
                    break;
                case MODE_STABILIZE:
                    debugData.flight_mode = "STABILIZE";
                    break;
                case MODE_ALTITUDE_HOLD:
                    debugData.flight_mode = "ALT_HOLD";
                    break;
                case MODE_POSITION_HOLD:
                    debugData.flight_mode = "POS_HOLD";
                    break;
                case MODE_EMERGENCY:
                    debugData.flight_mode = "EMERGENCY";
                    break;
                default:
                    debugData.flight_mode = "DISARMED";
                    break;
                }

                debugData.armed = flightState.motors_armed;
                debugData.throttle_input = controlInputs.throttle;
                debugData.throttle_pwm = mapFloat(controlInputs.throttle, 0.0, 1.0, MOTOR_IDLE, MOTOR_MAX);
                debugData.roll_angle = sensorData.roll_angle;
                debugData.pitch_angle = sensorData.pitch_angle;
                debugData.yaw_rate = sensorData.yaw_rate;
                debugData.altitude = sensorData.altitude_filtered;
                debugData.battery_voltage = sensorData.battery_voltage;

