sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller-v2.cpp
                // PID Debug Section
                debugData.pid_active = (flightState.mode >= MODE_STABILIZE);
                debugData.pid_enabled_by_throttle = (controlInputs.throttle > 0.30); // Show throttle deadband status (30%)
                debugData.roll_output = rollOutput;
                debugData.pitch_output = pitchOutput;
                debugData.yaw_output = yawOutput;
                debugData.roll_setpoint = rollSetpoint;
                debugData.pitch_setpoint = pitchSetpoint;
                debugData.yaw_setpoint = yawSetpoint;

                // Calibration Debug Section
                debugData.imu_cal_active = imuCal.calibrated;
                debugData.roll_cal_offset = imuCal.roll_offset;
                debugData.pitch_cal_offset = imuCal.pitch_offset;

                // Motor Mix Section
                debugData.base_pwm = debugData.throttle_pwm;
                debugData.motor1_final = motorOutputs.motor1;
                debugData.motor2_final = motorOutputs.motor2;
                debugData.motor3_final = motorOutputs.motor3;
                debugData.motor4_final = motorOutputs.motor4;
                debugData.motor1_offset = motorCal.motor1_offset;
                debugData.motor2_offset = motorCal.motor2_offset;
                debugData.motor3_offset = motorCal.motor3_offset;
                debugData.motor4_offset = motorCal.motor4_offset;

                // Inputs Section
                debugData.roll_input = controlInputs.roll;
                debugData.pitch_input = controlInputs.pitch;
                debugData.yaw_input = controlInputs.yaw;

                // System Section
                debugData.sensors_ok = sensorData.valid;
                debugData.emergency_active = flightState.emergency_stop;
                debugData.imu_calibrated = imuCal.calibrated;
                debugData.uptime = millis();
                debugData.free_heap = ESP.getFreeHeap();
                debugData.timestamp = millis();

                xSemaphoreGive(sensorMutex);
            }
        }

        // Only run control loops if armed and not in emergency
        if (flightState.motors_armed)
        {
            if (flightState.mode == MODE_MANUAL)
            {
                // Manual mode - direct throttle control without PID
                float baseThrottle = controlInputs.throttle;
                int basePWM = mapFloat(baseThrottle, 0.0, 1.0, MOTOR_IDLE, MOTOR_MAX);

                // All motors get same throttle in manual mode
                motorOutputs.motor1 = basePWM;
                motorOutputs.motor2 = basePWM;
                motorOutputs.motor3 = basePWM;
                motorOutputs.motor4 = basePWM;

                // Apply motor calibration offsets in manual mode too
                motorOutputs.motor1 += motorCal.motor1_offset;
                motorOutputs.motor2 += motorCal.motor2_offset;
                motorOutputs.motor3 += motorCal.motor3_offset;
                motorOutputs.motor4 += motorCal.motor4_offset;

                // Constrain all motor outputs to safe range
                motorOutputs.motor1 = constrain(motorOutputs.motor1, MOTOR_MIN, MOTOR_MAX);
                motorOutputs.motor2 = constrain(motorOutputs.motor2, MOTOR_MIN, MOTOR_MAX);
                motorOutputs.motor3 = constrain(motorOutputs.motor3, MOTOR_MIN, MOTOR_MAX);
                motorOutputs.motor4 = constrain(motorOutputs.motor4, MOTOR_MIN, MOTOR_MAX);

                // Output to motors
                outputMotorCommands();
            }
            else if (flightState.mode >= MODE_STABILIZE)
            {
                // Get latest sensor data (thread-safe)
                if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(5)) == pdTRUE)
                {
                    // Copy sensor data for control calculations
                    rollInput = sensorData.roll_angle;
                    pitchInput = sensorData.pitch_angle;
                    yawInput = sensorData.yaw_rate;
                    altitudeInput = sensorData.altitude_filtered;

                    xSemaphoreGive(sensorMutex);

                    // Run PID controllers
                    runPIDControllers();

                    // Mix motor outputs
                    mixMotorOutputs();

                    // Output to motors
                    outputMotorCommands();
                }
            }
        }
        else
        {
            // Motors disarmed - ensure all motors at idle
            motorOutputs.motor1 = MOTOR_ARM_VALUE;
            motorOutputs.motor2 = MOTOR_ARM_VALUE;
            motorOutputs.motor3 = MOTOR_ARM_VALUE;
            motorOutputs.motor4 = MOTOR_ARM_VALUE;
            outputMotorCommands();
        }
    }
}

void sensorTask(void *parameter)
{
    TickType_t xLastWakeTime = xTaskGetTickCount();
    const TickType_t xFrequency = pdMS_TO_TICKS(5); // 200Hz sensor reading

    Serial.println("Sensor Task started - Running at 200Hz");

    while (true)
    {
        vTaskDelayUntil(&xLastWakeTime, xFrequency);

        // Update all sensor readings
        updateSensors();

        // Calculate orientation from IMU
        calculateOrientation();

        // Update timestamp
        if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(2)) == pdTRUE)
        {
            sensorData.timestamp = millis();
            sensorData.valid = true;
            xSemaphoreGive(sensorMutex);
        }
    }
}

void telemetryTask(void *parameter)
{
    TickType_t xLastWakeTime = xTaskGetTickCount();
    const TickType_t xFrequency = pdMS_TO_TICKS(100); // 10Hz telemetry

    Serial.println("Telemetry Task started - Running at 10Hz");

    // Wait a few seconds before first status print
    vTaskDelay(pdMS_TO_TICKS(3000));
    Serial.println("=== FLIGHT CONTROLLER READY ===");
    Serial.printf("Web Dashboard: http://%s\n", WiFi.localIP().toString().c_str());
    Serial.println("Waiting for commands via web interface...");

    while (true)
    {
        vTaskDelayUntil(&xLastWakeTime, xFrequency);

        // Handle web server and telemetry
        // This will be expanded for NRF24L01 later

        // Print debug info every 5 seconds (reduce frequency further)
        static int counter = 0;
        if (++counter >= 50) // 5 seconds at 10Hz
        {
            counter = 0;

            if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(5)) == pdTRUE)
            {
                // Only print if we have valid sensor data
                if (sensorData.timestamp > 0)
                {
                    Serial.printf("Status - Mode: %d, Armed: %s, Roll: %.1f°, Pitch: %.1f°, Alt: %.1fm, Batt: %.1fV\n",
                                  flightState.mode,
                                  flightState.motors_armed ? "YES" : "NO",
                                  sensorData.roll_angle,
                                  sensorData.pitch_angle,
                                  sensorData.altitude_filtered,
                                  sensorData.battery_voltage);
                }
                xSemaphoreGive(sensorMutex);
            }
        }
    }
}

