sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller-v2.cpp
        Serial.println("Motors DISARMED");

        // Turn off center white LEDs when disarmed
        digitalWrite(NAV_FRONT_CENTER_WHITE, LOW);
        digitalWrite(NAV_BACK_CENTER_WHITE, LOW);
    }

    // Handle flight mode changes (when armed)
    if (flightState.motors_armed)
    {
        if (controlInputs.mode_switch)
        {
            flightState.mode = MODE_STABILIZE;
            Serial.println("Flight Mode: STABILIZE");
        }
        else
        {
            flightState.mode = MODE_MANUAL;
        }

        // Altitude hold activation disabled for testing
        // TODO: Implement proper altitude hold activation method (e.g., switch or button)
        /*
        // Altitude hold activation (example: holding yaw stick for 2 seconds)
        static unsigned long yaw_hold_start = 0;
        if (abs(controlInputs.yaw) < 0.1 && controlInputs.throttle > 0.3)
        {
            if (yaw_hold_start == 0)
            {
                yaw_hold_start = millis();
            }
            else if (millis() - yaw_hold_start > 2000)
            {
                flightState.altitude_hold_active = true;
                altitudeSetpoint = sensorData.altitude_filtered;
                Serial.println("Altitude Hold ACTIVATED");
                yaw_hold_start = 0;
            }
        }
        else
        {
            yaw_hold_start = 0;
            if (flightState.altitude_hold_active && abs(controlInputs.throttle) > 0.1)
            {
                flightState.altitude_hold_active = false;
                Serial.println("Altitude Hold DEACTIVATED");
            }
        }
        */
    }
}

// ================================
// UTILITY FUNCTIONS
// ================================

float mapFloat(float x, float in_min, float in_max, float out_min, float out_max)
{
    return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

float constrainFloat(float value, float min_val, float max_val)
{
    if (value < min_val)
        return min_val;
    if (value > max_val)
        return max_val;
    return value;
}

void calibrateIMU()
{
    Serial.println("===== IMU CALIBRATION STARTING =====");
    Serial.println("Place drone on FLAT GROUND and keep STATIONARY during calibration!");
    Serial.println("This calibration compensates for IMU mounting misalignment.");
    Serial.println("Calibration will take 15 seconds...");

    // Visual indication of calibration - blink all LEDs
    for (int i = 0; i < 5; i++)
    {
        digitalWrite(LED_R1_PIN, HIGH);
        digitalWrite(LED_G1_PIN, HIGH);
        digitalWrite(LED_B1_PIN, HIGH);
        digitalWrite(NAV_FRONT_RIGHT_GREEN, LOW);
        digitalWrite(NAV_BACK_RIGHT_GREEN, LOW);
        digitalWrite(NAV_BACK_LEFT_RED, LOW);
        digitalWrite(NAV_FRONT_LEFT_RED, LOW);
        delay(200);

        digitalWrite(LED_R1_PIN, LOW);
        digitalWrite(LED_G1_PIN, LOW);
        digitalWrite(LED_B1_PIN, LOW);
        digitalWrite(NAV_FRONT_RIGHT_GREEN, HIGH);
        digitalWrite(NAV_BACK_RIGHT_GREEN, HIGH);
        digitalWrite(NAV_BACK_LEFT_RED, HIGH);
        digitalWrite(NAV_FRONT_LEFT_RED, HIGH);
        delay(200);
    }

    // Calibration beep sequence
    for (int i = 0; i < 3; i++)
    {
        digitalWrite(BUZZER_PIN, HIGH);
        delay(100);
        digitalWrite(BUZZER_PIN, LOW);
        delay(100);
    }

    delay(2000); // Wait 2 seconds before starting calibration

    // Reset calibration values
    imuCal.roll_offset = 0.0;
    imuCal.pitch_offset = 0.0;
    imuCal.yaw_offset = 0.0;
    imuCal.accel_x_offset = 0.0;
    imuCal.accel_y_offset = 0.0;
    imuCal.accel_z_offset = 0.0;
    imuCal.gyro_x_offset = 0.0;
    imuCal.gyro_y_offset = 0.0;
    imuCal.gyro_z_offset = 0.0;

    // Extended calibration for better accuracy with longer samples
    const int numSamples = 1500; // 15 seconds at ~100Hz for higher precision
    float accel_x_sum = 0, accel_y_sum = 0, accel_z_sum = 0;
    float gyro_x_sum = 0, gyro_y_sum = 0, gyro_z_sum = 0;
    int validSamples = 0;

    Serial.println("Collecting extended calibration samples for precise mounting offset compensation...");

    for (int i = 0; i < numSamples; i++)
    {
        sensors_event_t accel, gyro, temp;
        if (mpu.getEvent(&accel, &gyro, &temp))
        {
            accel_x_sum += accel.acceleration.x;
            accel_y_sum += accel.acceleration.y;
            accel_z_sum += accel.acceleration.z;
            gyro_x_sum += gyro.gyro.x;
            gyro_y_sum += gyro.gyro.y;
            gyro_z_sum += gyro.gyro.z;
            validSamples++;
        }

        // Progress indication
        if (i % 150 == 0)
        {
            Serial.printf("Calibration progress: %d%%\n", (i * 100) / numSamples);
            // Brief beep for progress
            digitalWrite(BUZZER_PIN, HIGH);
            delay(30);
            digitalWrite(BUZZER_PIN, LOW);
        }

        delay(10); // ~100Hz sampling rate
    }

    if (validSamples > 750) // Need at least 750 valid samples for precision
    {
        // Calculate sensor offsets
        imuCal.accel_x_offset = accel_x_sum / validSamples;
        imuCal.accel_y_offset = accel_y_sum / validSamples;
        imuCal.accel_z_offset = (accel_z_sum / validSamples) - 9.81; // Remove gravity from Z-axis
        imuCal.gyro_x_offset = gyro_x_sum / validSamples;
        imuCal.gyro_y_offset = gyro_y_sum / validSamples;
        imuCal.gyro_z_offset = gyro_z_sum / validSamples;

        // Calculate the current "level" angles from flat ground position
        // These represent the IMU mounting misalignment relative to the drone frame
        float raw_roll = atan2(imuCal.accel_y_offset, sqrt(imuCal.accel_x_offset * imuCal.accel_x_offset + (imuCal.accel_z_offset + 9.81) * (imuCal.accel_z_offset + 9.81))) * 180.0 / PI;
        float raw_pitch = atan2(-imuCal.accel_x_offset, sqrt(imuCal.accel_y_offset * imuCal.accel_y_offset + (imuCal.accel_z_offset + 9.81) * (imuCal.accel_z_offset + 9.81))) * 180.0 / PI;

        // Store these as the offsets to subtract from future angle calculations
        // This makes the current flat ground position read as 0°, 0°
        imuCal.roll_offset = raw_roll;
        imuCal.pitch_offset = raw_pitch;
        imuCal.yaw_offset = 0.0; // Yaw reference is relative

        imuCal.calibrated = true;

        Serial.println("===== IMU CALIBRATION COMPLETED =====");
        Serial.printf("Accelerometer offsets: X=%.4f, Y=%.4f, Z=%.4f m/s²\n",
                      imuCal.accel_x_offset, imuCal.accel_y_offset, imuCal.accel_z_offset);
        Serial.printf("Gyroscope offsets: X=%.4f, Y=%.4f, Z=%.4f rad/s\n",
                      imuCal.gyro_x_offset, imuCal.gyro_y_offset, imuCal.gyro_z_offset);
        Serial.printf("IMU mounting angle offsets: Roll=%.3f°, Pitch=%.3f°\n",
                      imuCal.roll_offset, imuCal.pitch_offset);
        Serial.println("Current flat ground position will now read as 0°, 0° (perfect level).");
        Serial.println("PID setpoints for stabilize mode will be relative to this calibrated level position.");

