sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller-v2.cpp
        <!-- Flight Controller Debug Console -->
        <div class="card">
            <h2>Flight Controller Debug Console</h2>
            <div style="background: #1e1e1e; color: #00ff00; padding: 15px; border-radius: 4px; font-family: 'Courier New', monospace; font-size: 14px; max-height: 600px; overflow-y: auto;" id="debugConsole">
                <div style="color: #ffffff;">======== FLIGHT CONTROLLER DEBUG ========</div>
                <div id="debugContent">
                    <div style="color: #ffff00;">[Status]</div>
                    <div>Mode: DISARMED | Armed: NO | Throttle: 0.00 (PWM: 1100)</div>
                    <div>Roll: 0.0° | Pitch: 0.0° | Yaw: 0.0°/s | Alt: 0.0m | Batt: 0.0V</div>
                    <br>
                    <div style="color: #ffff00;">[System]</div>
                    <div>Loop Freq: 100Hz | Sensors: OK | Emergency: NO</div>
                    <div>Uptime: 0 ms | Free Heap: 0 bytes</div>
                </div>
                <div style="color: #ffffff; margin-top: 10px;">==========================================</div>
            </div>
            <div style="text-align: center; margin-top: 10px;">
                <button class="btn-primary" onclick="toggleDebugConsole()">Toggle Auto-Update</button>
                <button class="btn-primary" onclick="clearDebugConsole()">Clear Console</button>
            </div>
        </div>
    </div>

    <script>
        let controlUpdateTimeout = null;
        let armed = false;
        let flightMode = 'MANUAL';
        
        // Update flight data every 100ms
        setInterval(updateFlightData, 100);
        
        // Send heartbeat control data every 500ms to prevent timeout
        setInterval(sendHeartbeat, 500);
        
        function sendHeartbeat() {
            // Only send heartbeat if armed
            if (armed) {
                const data = {
                    throttle: parseFloat(document.getElementById('throttle').value) / 100.0,
                    roll: parseFloat(document.getElementById('roll').value) / 100.0,
                    pitch: parseFloat(document.getElementById('pitch').value) / 100.0,
                    yaw: parseFloat(document.getElementById('yaw').value) / 100.0
                };
                
                fetch('/api/control', {
                    method: 'POST',
                    headers: {'Content-Type': 'application/json'},
                    body: JSON.stringify(data)
                });
            }
        }
        
        function updateFlightData() {
            fetch('/api/flight_data')
                .then(response => response.json())
                .then(data => {
                    updateFlightStatus(data.status);
                    updateSensorDisplay(data.sensors);
                })
                .catch(error => console.log('Data update error:', error));
        }
        
        function updateFlightStatus(status) {
            const container = document.getElementById('flightStatus');
            const emergency = document.getElementById('emergencyAlert');
            
            armed = status.armed;
            flightMode = status.mode;
            
            let statusClass = status.armed ? 'status-armed' : 'status-disarmed';
            let modeClass = status.mode === 'STABILIZE' ? 'status-stabilize' : 'status-manual';
            
            container.innerHTML = `
                <div class="status-item ${statusClass}">${status.armed ? '[ARMED]' : '[DISARMED]'}</div>
                <div class="status-item ${modeClass}">${status.mode} Mode</div>
                <div class="status-item">Alt Hold: ${status.altitude_hold ? 'ON' : 'OFF'}</div>
            `;
            
            if (status.emergency) {
                emergency.style.display = 'block';
            } else {
                emergency.style.display = 'none';
            }
        }
        
        function updateSensorDisplay(sensors) {
            const container = document.getElementById('sensorData');
            container.innerHTML = `
                <div class="sensor-value">Roll: ${sensors.roll.toFixed(1)} deg</div>
                <div class="sensor-value">Pitch: ${sensors.pitch.toFixed(1)} deg</div>
                <div class="sensor-value">Yaw Rate: ${sensors.yaw_rate.toFixed(1)} deg/s</div>
                <div class="sensor-value">Altitude: ${sensors.altitude.toFixed(2)} m</div>
                <div class="sensor-value">Battery: ${sensors.battery_voltage.toFixed(2)}V (${sensors.battery_percentage.toFixed(1)}%)</div>
                <div class="sensor-value">GPS: ${sensors.satellites} sats</div>
                <div class="sensor-value">Motor 1: ${sensors.motor1}</div>
                <div class="sensor-value">Motor 2: ${sensors.motor2}</div>
                <div class="sensor-value">Motor 3: ${sensors.motor3}</div>
                <div class="sensor-value">Motor 4: ${sensors.motor4}</div>
            `;
        }
        
        function updateControl() {
            document.getElementById('throttle_val').textContent = document.getElementById('throttle').value + '%';
            document.getElementById('roll_val').textContent = document.getElementById('roll').value;
            document.getElementById('pitch_val').textContent = document.getElementById('pitch').value;
            document.getElementById('yaw_val').textContent = document.getElementById('yaw').value;
            
            // Throttle control input updates
            if (controlUpdateTimeout) clearTimeout(controlUpdateTimeout);
            controlUpdateTimeout = setTimeout(() => {
                const data = {
                    throttle: parseFloat(document.getElementById('throttle').value) / 100.0,
                    roll: parseFloat(document.getElementById('roll').value) / 100.0,
                    pitch: parseFloat(document.getElementById('pitch').value) / 100.0,
                    yaw: parseFloat(document.getElementById('yaw').value) / 100.0
                };
                
                fetch('/api/control', {
                    method: 'POST',
                    headers: {'Content-Type': 'application/json'},
                    body: JSON.stringify(data)
                });
            }, 50); // 20Hz update rate
        }
        
