sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller-v2.cpp
        function armMotors() {
            // Safety: Set throttle to 0 before arming
            document.getElementById('throttle').value = 0;
            updateControl();
            
            fetch('/api/arm', {method: 'POST'})
                .then(() => console.log('Arm command sent - throttle set to 0 for safety'));
        }
        
        function disarmMotors() {
            fetch('/api/disarm', {method: 'POST'})
                .then(() => console.log('Disarm command sent'));
        }
        
        function toggleFlightMode() {
            fetch('/api/toggle_mode', {method: 'POST'})
                .then(() => console.log('Mode toggle sent'));
        }
        
        function emergencyStop() {
            if (confirm('EMERGENCY STOP - Are you sure?')) {
                fetch('/api/emergency', {method: 'POST'})
                    .then(() => console.log('Emergency stop activated'));
            }
        }
        
        function updatePID() {
            const pidData = {
                roll_p: parseFloat(document.getElementById('roll_p').value),
                roll_i: parseFloat(document.getElementById('roll_i').value),
                roll_d: parseFloat(document.getElementById('roll_d').value),
                pitch_p: parseFloat(document.getElementById('pitch_p').value),
                pitch_i: parseFloat(document.getElementById('pitch_i').value),
                pitch_d: parseFloat(document.getElementById('pitch_d').value),
                yaw_p: parseFloat(document.getElementById('yaw_p').value),
                yaw_i: parseFloat(document.getElementById('yaw_i').value),
                yaw_d: parseFloat(document.getElementById('yaw_d').value)
            };
            
            fetch('/api/pid_update', {
                method: 'POST',
                headers: {'Content-Type': 'application/json'},
                body: JSON.stringify(pidData)
            });
        }
        
        function updateMotorCal() {
            const motorCalData = {
                motor1_offset: parseFloat(document.getElementById('motor1_offset').value),
                motor2_offset: parseFloat(document.getElementById('motor2_offset').value),
                motor3_offset: parseFloat(document.getElementById('motor3_offset').value),
                motor4_offset: parseFloat(document.getElementById('motor4_offset').value)
            };
            
            fetch('/api/motor_calibration', {
                method: 'POST',
                headers: {'Content-Type': 'application/json'},
                body: JSON.stringify(motorCalData)
            }).then(() => console.log('Motor calibration updated'));
        }
        
        function resetMotorCal() {
            document.getElementById('motor1_offset').value = 0;
            document.getElementById('motor2_offset').value = 0;
            document.getElementById('motor3_offset').value = 0;
            document.getElementById('motor4_offset').value = 0;
            updateMotorCal();
        }
        
        function saveMotorCal() {
            // Save current calibration values (could be expanded to EEPROM storage)
            updateMotorCal();
            alert('Motor calibration saved!');
        }
        
        // Debug Console Functionality
        let debugUpdateEnabled = true;
        let debugUpdateInterval = null;
        
        // Start debug updates automatically
        function startDebugUpdates() {
            if (debugUpdateInterval) clearInterval(debugUpdateInterval);
            debugUpdateInterval = setInterval(updateDebugConsole, 1000); // Update every 1 second
        }
        
        function updateDebugConsole() {
            if (!debugUpdateEnabled) return;
            
            fetch('/api/debug')
                .then(response => response.json())
                .then(data => {
                    const content = document.getElementById('debugContent');
                    let html = '';
                    
                    // [Status] Section
                    html += '<div style="color: #ffff00;">[Status]</div>';
                    html += `<div>Mode: ${data.status.mode} | Armed: ${data.status.armed ? 'YES' : 'NO'} | Throttle: ${data.status.throttle.toFixed(2)} (PWM: ${data.status.throttle_pwm})</div>`;
                    html += `<div>Roll: ${data.status.roll.toFixed(1)}° | Pitch: ${data.status.pitch.toFixed(1)}° | Yaw: ${data.status.yaw_rate.toFixed(1)}°/s | Alt: ${data.status.altitude.toFixed(1)}m | Batt: ${data.status.battery.toFixed(1)}V</div>`;
                    html += '<br>';
                    
                    // [PID Debug] Section - only if PID active
                    if (data.pid.active) {
                        html += '<div style="color: #ffff00;">[PID Debug]</div>';
                        html += `<div>Roll: ${data.pid.roll_output >= 0 ? '+' : ''}${data.pid.roll_output.toFixed(1)} | Pitch: ${data.pid.pitch_output >= 0 ? '+' : ''}${data.pid.pitch_output.toFixed(1)} | Yaw: ${data.pid.yaw_output >= 0 ? '+' : ''}${data.pid.yaw_output.toFixed(1)}</div>`;
                        html += `<div>Setpoints -> Roll: ${data.pid.roll_setpoint >= 0 ? '+' : ''}${data.pid.roll_setpoint.toFixed(1)}° | Pitch: ${data.pid.pitch_setpoint >= 0 ? '+' : ''}${data.pid.pitch_setpoint.toFixed(1)}° | Yaw: ${data.pid.yaw_setpoint >= 0 ? '+' : ''}${data.pid.yaw_setpoint.toFixed(1)}°/s</div>`;
                        html += `<div>PID Status: ${data.pid.enabled_by_throttle ? '<span style="color: #00ff00;">ACTIVE</span>' : '<span style="color: #ff6600;">THROTTLE DEADBAND</span>'} (Min throttle: 15% for control)</div>`;
                        html += '<br>';
                    }
                    
                    // [Calibration] Section - show calibration offsets
                    if (data.calibration && data.calibration.active) {
                        html += '<div style="color: #ffff00;">[Calibration]</div>';
                        html += `<div>IMU Level Offsets -> Roll: ${data.calibration.roll_offset >= 0 ? '+' : ''}${data.calibration.roll_offset.toFixed(2)}° | Pitch: ${data.calibration.pitch_offset >= 0 ? '+' : ''}${data.calibration.pitch_offset.toFixed(2)}°</div>`;
                        html += '<div>Current angles are relative to these calibrated level positions</div>';
                        html += '<br>';
                    }
                    
