sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller-v2.cpp
    // API: Emergency stop
    server.on("/api/emergency", HTTP_POST, []()
              {
        flightState.emergency_stop = true;
        Serial.println("EMERGENCY STOP ACTIVATED via web interface!");
        server.send(200, "text/plain", "Emergency stop activated"); });

    // API: Update PID parameters
    server.on("/api/pid_update", HTTP_POST, []()
              {
        if (server.hasArg("plain")) {
            StaticJsonDocument<512> doc;
            deserializeJson(doc, server.arg("plain"));
            
            // Update PID parameters
            pidParams.roll_kp = doc["roll_p"];
            pidParams.roll_ki = doc["roll_i"];
            pidParams.roll_kd = doc["roll_d"];
            pidParams.pitch_kp = doc["pitch_p"];
            pidParams.pitch_ki = doc["pitch_i"];
            pidParams.pitch_kd = doc["pitch_d"];
            pidParams.yaw_kp = doc["yaw_p"];
            pidParams.yaw_ki = doc["yaw_i"];
            pidParams.yaw_kd = doc["yaw_d"];
            
            // Apply to PID controllers
            rollPID.SetTunings(pidParams.roll_kp, pidParams.roll_ki, pidParams.roll_kd);
            pitchPID.SetTunings(pidParams.pitch_kp, pidParams.pitch_ki, pidParams.pitch_kd);
            yawPID.SetTunings(pidParams.yaw_kp, pidParams.yaw_ki, pidParams.yaw_kd);
            
            Serial.println("PID parameters updated");
            server.send(200, "text/plain", "PID updated");
        } else {
            server.send(400, "text/plain", "No data");
        } });

    // API: Update Motor Calibration
    server.on("/api/motor_calibration", HTTP_POST, []()
              {
        if (server.hasArg("plain")) {
            StaticJsonDocument<256> doc;
            deserializeJson(doc, server.arg("plain"));
            
            // Update motor calibration offsets
            motorCal.motor1_offset = doc["motor1_offset"];
            motorCal.motor2_offset = doc["motor2_offset"];
            motorCal.motor3_offset = doc["motor3_offset"];
            motorCal.motor4_offset = doc["motor4_offset"];
            
            Serial.printf("Motor calibration updated - M1: %.1f, M2: %.1f, M3: %.1f, M4: %.1f\n",
                         motorCal.motor1_offset, motorCal.motor2_offset,
                         motorCal.motor3_offset, motorCal.motor4_offset);
            server.send(200, "text/plain", "Motor calibration updated");
        } else {
            server.send(400, "text/plain", "No data");
        } });

    // API: Debug Data for Web Dashboard
    server.on("/api/debug", HTTP_GET, []()
              {
        StaticJsonDocument<1024> doc;
        
        // Status Section
        doc["status"]["mode"] = debugData.flight_mode;
        doc["status"]["armed"] = debugData.armed;
        doc["status"]["throttle"] = debugData.throttle_input;
        doc["status"]["throttle_pwm"] = debugData.throttle_pwm;
        doc["status"]["roll"] = debugData.roll_angle;
        doc["status"]["pitch"] = debugData.pitch_angle;
        doc["status"]["yaw_rate"] = debugData.yaw_rate;
        doc["status"]["altitude"] = debugData.altitude;
        doc["status"]["battery"] = debugData.battery_voltage;
        
        // PID Debug Section
        doc["pid"]["active"] = debugData.pid_active;
        doc["pid"]["enabled_by_throttle"] = debugData.pid_enabled_by_throttle;
        doc["pid"]["roll_output"] = debugData.roll_output;
        doc["pid"]["pitch_output"] = debugData.pitch_output;
        doc["pid"]["yaw_output"] = debugData.yaw_output;
        doc["pid"]["roll_setpoint"] = debugData.roll_setpoint;
        doc["pid"]["pitch_setpoint"] = debugData.pitch_setpoint;
        doc["pid"]["yaw_setpoint"] = debugData.yaw_setpoint;
        
        // Calibration Debug Section
        doc["calibration"]["active"] = debugData.imu_cal_active;
        doc["calibration"]["roll_offset"] = debugData.roll_cal_offset;
        doc["calibration"]["pitch_offset"] = debugData.pitch_cal_offset;
        
        // Motor Mix Section
        doc["motors"]["base_pwm"] = debugData.base_pwm;
        doc["motors"]["motor1"] = debugData.motor1_final;
        doc["motors"]["motor2"] = debugData.motor2_final;
        doc["motors"]["motor3"] = debugData.motor3_final;
        doc["motors"]["motor4"] = debugData.motor4_final;
        doc["motors"]["cal1"] = debugData.motor1_offset;
        doc["motors"]["cal2"] = debugData.motor2_offset;
        doc["motors"]["cal3"] = debugData.motor3_offset;
        doc["motors"]["cal4"] = debugData.motor4_offset;
        
        // Inputs Section
        doc["inputs"]["throttle"] = debugData.throttle_input;
        doc["inputs"]["roll"] = debugData.roll_input;
        doc["inputs"]["pitch"] = debugData.pitch_input;
        doc["inputs"]["yaw"] = debugData.yaw_input;
        
        // System Section
        doc["system"]["sensors_ok"] = debugData.sensors_ok;
        doc["system"]["emergency"] = debugData.emergency_active;
        doc["system"]["imu_calibrated"] = debugData.imu_calibrated;
        doc["system"]["uptime"] = debugData.uptime;
        doc["system"]["free_heap"] = debugData.free_heap;
        doc["system"]["timestamp"] = debugData.timestamp;
        
        String response;
        serializeJson(doc, response);
        server.send(200, "application/json", response); });

    server.begin();
    Serial.println("Web server started - Flight Controller Dashboard ready");
}

// ================================
// LED CONTROL FUNCTIONS
// ================================

void initializeLEDs()
{
    // Initialize navigation LED pins
    pinMode(NAV_FRONT_RIGHT_GREEN, OUTPUT);
    pinMode(NAV_BACK_RIGHT_GREEN, OUTPUT);
    pinMode(NAV_BACK_LEFT_RED, OUTPUT);
    pinMode(NAV_FRONT_CENTER_WHITE, OUTPUT);
    pinMode(NAV_FRONT_LEFT_RED, OUTPUT);
    pinMode(NAV_BACK_CENTER_WHITE, OUTPUT);

    // Turn on navigation lights immediately (always on when powered)
    digitalWrite(NAV_FRONT_RIGHT_GREEN, HIGH);
    digitalWrite(NAV_BACK_RIGHT_GREEN, HIGH);
    digitalWrite(NAV_BACK_LEFT_RED, HIGH);
    digitalWrite(NAV_FRONT_LEFT_RED, HIGH);

    // Center white LEDs start off (controlled by status)
    digitalWrite(NAV_FRONT_CENTER_WHITE, LOW);
    digitalWrite(NAV_BACK_CENTER_WHITE, LOW);

    Serial.println("Navigation LEDs initialized");
}

void updateNavigationLights()
{
    // Nav lights (Red/Green) are always ON during powered-on state
    // This helps identify orientation at night (Red = left, Green = right)
    static bool nav_lights_on = true;

    if (nav_lights_on)
    {
        digitalWrite(NAV_FRONT_RIGHT_GREEN, HIGH);
        digitalWrite(NAV_BACK_RIGHT_GREEN, HIGH);
        digitalWrite(NAV_BACK_LEFT_RED, HIGH);
        digitalWrite(NAV_FRONT_LEFT_RED, HIGH);
    }
}

void updateStatusLights()
{
    static unsigned long last_blink_time = 0;
    static bool blink_state = false;
    unsigned long now = millis();

    // Center white LEDs behavior based on flight state
    if (!flightState.motors_armed)
    {
        // Arming Blink: Slow blink when waiting to arm (1Hz)
        if (now - last_blink_time > 500)
        {
            last_blink_time = now;
            blink_state = !blink_state;
            digitalWrite(NAV_FRONT_CENTER_WHITE, blink_state);
            digitalWrite(NAV_BACK_CENTER_WHITE, blink_state);
        }
    }
    else
    {
        // Flight Mode On: Solid light when armed
        digitalWrite(NAV_FRONT_CENTER_WHITE, HIGH);
        digitalWrite(NAV_BACK_CENTER_WHITE, HIGH);

        // Optional: Throttle Sync Pulse - Flash intensity reflects throttle level
        setThrottlePulse(controlInputs.throttle);
    }
}

void setThrottlePulse(float throttle_percentage)
{
    // Optional throttle sync pulse feature
    // Flash the center white LEDs with intensity reflecting throttle level
    static unsigned long last_pulse_time = 0;
    static bool pulse_state = false;
    unsigned long now = millis();

    // Only pulse if throttle is above minimum and motors are armed
    if (flightState.motors_armed && throttle_percentage > 0.05)
    {
        // Pulse frequency increases with throttle (10Hz to 50Hz)
        int pulse_interval = map(throttle_percentage * 100, 5, 100, 100, 20);

        if (now - last_pulse_time > pulse_interval)
        {
            last_pulse_time = now;
            pulse_state = !pulse_state;

            // Brief flash to indicate throttle activity
            if (pulse_state)
            {
                digitalWrite(NAV_FRONT_CENTER_WHITE, LOW);
                digitalWrite(NAV_BACK_CENTER_WHITE, LOW);
            }
            else
            {
                digitalWrite(NAV_FRONT_CENTER_WHITE, HIGH);
                digitalWrite(NAV_BACK_CENTER_WHITE, HIGH);
            }
        }
    }
}
